alejandro-cp95/Bootloader/Bootloader_STM32F334/Src/main.c
/* Modifying user option bytes:
 * • Check that no Flash memory operation is ongoing by checking the BSY bit in the FLASH_SR register.
 * • Unlock the OPTWRE bit in the FLASH_CR register (This bit is set on writing the correct key sequence to the FLASH_OPTKEYR register)
 * • Set the OPTPG bit in the FLASH_CR register
 * • Write the data (half-word) to the desired address
 * • Wait for the BSY bit to be reset.
 * • Read the programmed value and verify. */
uint8_t configure_flash_page_rw_protection(uint8_t page_details, uint8_t protection_mode, uint8_t disable)
{
	/* First configure the protection mode
	 * protection_mode = 1 means write protect of the user flash pages
	 * protection_mode = 2 means read/write protect of the user flash pages */
	volatile uint16_t* pWP1 = (uint16_t*)0x1FFFF80A;
	volatile uint16_t* pWP0 = (uint16_t*)0x1FFFF808;
	volatile uint16_t* pRDP = (uint16_t*)0x1FFFF800;

	if(disable)
	{
		// Disable all R/W protection on pages

		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 1. Unlock flash */
		HAL_FLASH_Unlock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);
		/* 2. Option byte configuration unlock */
		HAL_FLASH_OB_Unlock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 3. Erase option bytes by setting OPTER bit and after that STRT bit */
		FLASH->CR |= (1<<5);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);
		FLASH->CR |= (1<<6);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 4. After the erasure is complete, reset the OPTER bit */
		FLASH->CR &= ~(1<<5);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 5. Set the OPTPG bit to allow programming option bytes */
		FLASH->CR |= (1<<4);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 6. */
		/* Here we are disabling read and write protection for the pages.
		 * When read protection is disabled a POR should be done */
		*pWP0=(uint16_t)0xFF;
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);
		*pWP1=(uint16_t)0xFF;
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);
		*pRDP=(uint16_t)0xAA;
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 7. Reset the OPTPG bit to complete/close programming option bytes */
		FLASH->CR &= ~(1<<4);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 8. Launch/Apply the Option bytes (OBL_LAUNCH bit is set-system reset will be performed after this) */
		FLASH->CR |= (1<<13);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 9. Lock option bytes (OPTWRE is reset) */
		HAL_FLASH_OB_Lock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 10. Lock the Flash (LOCK bit is set) */
		HAL_FLASH_Lock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		return 0;
	}
	if(protection_mode==(uint8_t) 1)
	{
		/* We are putting write protection on the pages encoded in page_details */

		/* - The write protection is implemented with a granularity of 2 pages. It is activated by
		 * configuring the WRP[1:0] option bytes, and then by reloading them by setting the
		 * OBL_LAUNCH bit in the FLASH_CR register. */

		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 1. Unlock flash */
		HAL_FLASH_Unlock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);
		/* 2. Option byte configuration unlock */
		HAL_FLASH_OB_Unlock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 3. Erase option bytes by setting OPTER bit and after that STRT bit */
		FLASH->CR |= (1<<5);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);
		FLASH->CR |= (1<<6);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 4. After the erasure is complete, reset the OPTER bit */
		FLASH->CR &= ~(1<<5);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 5. Set the OPTPG bit to allow programming option bytes */
		FLASH->CR |= (1<<4);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 6. */
		/* Here we are setting just write protection for the pages */

		/* Put write protection on pages */
		*pWP0&=~((uint16_t)page_details);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 7. Reset the OPTPG bit to complete/close programming option bytes */
		FLASH->CR &= ~(1<<4);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 8. Launch/Apply the Option bytes (OBL_LAUNCH bit is set-system reset will be performed after this) */
		FLASH->CR |= (1<<13);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 9. Lock option bytes (OPTWRE is reset) */
		HAL_FLASH_OB_Lock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 10. Lock the Flash (LOCK bit is set) */
		HAL_FLASH_Lock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);
	}
	else if(protection_mode==(uint8_t) 2)
	{
		/* We are putting read/write protection */

		/* - The write protection is implemented with a granularity of 2 pages. It is activated by
		 * configuring the WRP[1:0] option bytes, and then by reloading them by setting the
		 * OBL_LAUNCH bit in the FLASH_CR register.
		 * - The read protection is activated by setting the RDP option byte and then,
		 * by applying a system reset to reload the new RDP option byte.*/

		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 1. Unlock flash */
		HAL_FLASH_Unlock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);
		/* 2. Option byte configuration unlock */
		HAL_FLASH_OB_Unlock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

