alejandro-cp95/Bootloader/Bootloader_STM32F334/Src/main.c
		/* 3. Erase option bytes by setting OPTER bit and after that STRT bit */
		FLASH->CR |= (1<<5);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);
		FLASH->CR |= (1<<6);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 4. After the erasure is complete, reset the OPTER bit */
		FLASH->CR &= ~(1<<5);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 5. Set the OPTPG bit to allow programming option bytes */
		FLASH->CR |= (1<<4);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)!=RESET);

		/* 6. */
		/* Here we are setting read and write protection for the pages */

		/* Put read and write protection on pages */
		*pWP0&=~(page_details);
		*pRDP=(uint16_t)0xFF;
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 7. Reset the OPTPG bit to complete/close programming option bytes */
		FLASH->CR &= ~(1<<4);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 8. Launch/Apply the Option bytes (OBL_LAUNCH bit is set-system reset will be performed after this) */
		FLASH->CR |= (1<<13);
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 9. Lock option bytes (OPTWRE is reset) */
		HAL_FLASH_OB_Lock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);

		/* 10. Lock the Flash (LOCK bit is set) */
		HAL_FLASH_Lock();
		/* Wait till no active operation on flash */
		while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET);
	}
	return 0;
}

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
